{
  "upcoming": [
    {
      "slug": "2025-06-10-recital-in-the-park",
      "title": "Recital in the Park",
      "date": "2025-06-10",
      "dateLabel": "Jun 10, 2025",
      "startTime": "",
      "endTime": "",
      "timeLabel": "",
      "status": "upcoming",
      "category": "Community recital",
      "location": "Seattle (TBD)",
      "featured": true,
      "summary": "A family-friendly recital celebrating youth and adult student progress.",
      "image": "/assets/uploads/placeholder-photo-3.svg",
      "body": "<p>Join STI students for a community recital in a local Seattle park. The program\ncelebrates youth and adult students and includes short introductions to rhythm\nand tala for new audiences.</p>\n"
    },
    {
      "slug": "2025-07-20-guest-artist-collaboration",
      "title": "Guest Artist Collaboration",
      "date": "2025-07-20",
      "dateLabel": "Jul 20, 2025",
      "startTime": "",
      "endTime": "",
      "timeLabel": "",
      "status": "upcoming",
      "category": "Guest artist",
      "location": "Bellevue (TBD)",
      "featured": false,
      "summary": "Collaborative performance with sitar and sarangi artists, plus Q&A.",
      "image": "/assets/uploads/placeholder-photo-2.svg",
      "body": "<p>STI welcomes guest artists for an evening of Hindustani classical music,\nincluding sitar and sarangi performances alongside tabla. The event includes a\nshort educational segment and audience Q&amp;A.</p>\n"
    },
    {
      "slug": "Destination Roadhouse \"Music Around The World\" Taiyari",
      "title": "Destination Roadhouse \"Music Around The World\" Taiyari",
      "date": "2026-02-07",
      "dateLabel": "Feb 07, 2026",
      "startTime": "7pm",
      "endTime": "9pm",
      "timeLabel": "7pm–9pm",
      "status": "upcoming",
      "category": "",
      "location": "The Roadhouse 19955 28th Avenue South SeaTac, WA 98188",
      "featured": true,
      "summary": "Indian classical music - Kathak Dance and Sarod and Tabla performance",
      "image": "",
      "body": "<p>Pooja Ganesh is a Kathak dancer, choreographer, and vocalist with over 15 years of training under Sangeet Natak Akademi awardees Smt. Nirupama Rajendra and Shri T.D. Rajendra, and currently under Gurus Parul Shah and Smt. Nirmala Madhava (Pampa) in the U.S. She has performed and presented original works at prestigious venues and festivals including Mysore Dasara, Bangalore International Film Festival, Moore Theatre (Seattle Theatre Group), New York Kathak Festival, YUVA Festival, and Yuva Bharati. An Artist-in-Residence with Seattle Theatre Group in 2024, she has toured internationally with Abhinava Dance Company and collaborated on cross-cultural productions such as Kathak–Flamenco.</p>\n<p>Ravi Albright is a professional tabla player and the Executive Director of Seattle Tabla Institute<a href=\"http://www.acitseattle.org/\">,</a>a 501c3 non-profit organization, offering ongoing classes, workshops and musical events throughout the year in Seattle, WA. Born in Seattle, Ravi has been a student of North Indian classical tabla drumming in both India and the U.S. since his youth. He is one of only a few ganda-banda ( formally recognized ) disciples of Pandit Anindo Chatterje of Kolkata, India.Abhishek Arora has grown up with a deep appreciation of Indian classical music since his childhood. He began his musical journey at a young age, learning harmonium and vocal music under the guidance of his mother. His exploration of Indian classical music expanded when he studied the sarod, a 23-string fretless instrument that produces smooth sliding notes (similar to a slide guitar) along with intricate percussive patterns. Abhishek studied the sarod under the mentorship of Brandon Machintosh, an internationally recognized performer and teacher based in Seattle. Over the past 10 years, he has also been studying the bansuri, the Indian bamboo flute, under the guidance of Shakthidhar Iyer, a world-renowned flautist based in India.For the past 16 years, Abhishek has been teaching meditation through music, conducting seminars and tours across the U.S. His performances guide listeners on a meditative journey of self-discovery, using this ancient music to connect with the inner self. When he&#39;s not playing music. He is excited to share the beauty of Indian classical music with us today through this performance.</p>\n"
    }
  ],
  "past": []
}